InformationRegisters/ЗаданияТППоВнеплановымПосещениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияТППоВнеплановымПосещениям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Удалить_ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблонАнкетыДляТП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязательное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Посещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Посещение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Маршрут</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗаданийТорговымПредставителям</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблонАнкетыДляТП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗаданияТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияТП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Удалить_ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблонАнкетыДляТП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязательное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Маршрут</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗаданийТорговымПредставителям</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблонАнкетыДляТП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыВопросовАнкетДляТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыВопросовАнкетДляТП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводЗначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборЗначенияИзСписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборНесколькихЗначений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборИзСправочника</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ШаблонАнкетыДляТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ШаблонАнкетыДляТП</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВопросыВыводитьПоОчереди</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВопросыАнкетДляТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ВопросыАнкетДляТП</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ШаблонАнкетыДляТП</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипВопроса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВопросовАнкетДляТП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаЗаполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСправочника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Территории</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ФБ_Базы</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветРодителя</Name>
					<Comment>Ответ при котором выводится данный вопрос</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Территории</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.ФБ_Базы</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВариантыОтветов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УказатьПояснение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗакончитьАнкетирование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбновлениеИнформационнойБазы/Ext/Module.bsl
&Насервере
Процедура ОбновлениеИнформационнойБазы() Экспорт
	
	ТекущаяВерсия = Константы.ВерсияКонфигурации.Получить();
	
	Если СинхронизацияСервер.ТребуетсяОбновление(ТекущаяВерсия, Метаданные.Версия) Тогда
		
		Результат = ОбновлениеНаВерсию_2_1_01();
		
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Если Результат.Ошибка = Истина Тогда
			
			Сообщить("Ошибка обновления возможна некорректная работа системы.
						|Обратитесь к администратору", СтатусСообщения.Важное);
			
		Иначе
			
			Константы.ВерсияКонфигурации.Установить(Метаданные.Версия);
			
			Сообщить("Обновление успешно завершено.", СтатусСообщения.Информация);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&Насервере
Функция ОбновлениеНаВерсию_2_1_01()
	
	Сообщить("Производится обновление на версию 2.0.100.");
	Ошибка = Новый Структура();	
	
	Попытка
	
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ЗаданияТППоВнеплановымПосещениям.Регистратор
		               |ИЗ
		               |	РегистрСведений.ЗаданияТППоВнеплановымПосещениям КАК ЗаданияТППоВнеплановымПосещениям
		               |ГДЕ
		               |	ЗаданияТППоВнеплановымПосещениям.Удалить_ШаблонАнкеты <> ЗНАЧЕНИЕ(Справочник.ШаблонАнкетыДляТП.ПустаяСсылка)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Набор = РегистрыСведений.ЗаданияТППоВнеплановымПосещениям.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(Выборка.Регистратор);
			Набор.Прочитать();
			
			Для каждого Стр из Набор Цикл
				
				Если ЗначениеЗаполнено(Стр.Удалить_ШаблонАнкеты) Тогда
					
					Стр.ШаблонАнкеты = Стр.Удалить_ШаблонАнкеты;
					Стр.Удалить_ШаблонАнкеты  = Справочники.ШаблонАнкетыДляТП.ПустаяСсылка();
					
				КонецЕсли;
				
			КонецЦикла;
			
			Набор.Записать();
			
		КонецЦикла;
		
		
		
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ЗаданияТП.Регистратор
		               |ИЗ
		               |	РегистрСведений.ЗаданияТП КАК ЗаданияТП
		               |ГДЕ
		               |	ЗаданияТП.Удалить_ШаблонАнкеты <> ЗНАЧЕНИЕ(Справочник.ШаблонАнкетыДляТП.ПустаяСсылка)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Набор = РегистрыСведений.ЗаданияТП.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(Выборка.Регистратор);
			Набор.Прочитать();
			
			Для каждого Стр из Набор Цикл
				
				Если ЗначениеЗаполнено(Стр.Удалить_ШаблонАнкеты) Тогда
					
					Стр.ШаблонАнкеты = Стр.Удалить_ШаблонАнкеты;
					Стр.Удалить_ШаблонАнкеты  = Справочники.ШаблонАнкетыДляТП.ПустаяСсылка();
					
				КонецЕсли;
				
			КонецЦикла;
			
			Набор.Записать();
			
		КонецЦикла;
		
		
		Ошибка.Вставить("Ошибка", Ложь)
		
	Исключение
		
		Ошибка.Вставить("Ошибка", Истина);
		Ошибка.Вставить("ТекстОшибки", ОписаниеОшибки());
		
	КонецПопытки;	
	
	Возврат Ошибка;	
	
КонецФункции

//Удалить. Делалось для теста
Процедура СоздатьАнкетуТест()
	
	Пользователь = Справочники.Пользователи.СоздатьЭлемент();
	Пользователь.Наименование = "Пользователь";
	Пользователь.Записать();
	
	Константы.ТекущийПользователь.Установить(Пользователь.Ссылка);
	
	Шаблон = Справочники.ШаблонАнкетыДляТП.СоздатьЭлемент();
	Шаблон.Наименование = "Тест";
	Шаблон.ВопросыВыводитьПоОчереди = Истина;
	Шаблон.Идентификатор = "Тест";
	
	Шаблон.Записать();
	
	Вопрос = Справочники.ВопросыАнкетДляТП.СоздатьЭлемент();
	Вопрос.Наименование = "Состояние";
	Вопрос.ТипВопроса = Перечисления.ТипыВопросовАнкетДляТП.ВыборЗначенияИзСписка;
	Вопрос.Владелец = Шаблон.Ссылка;
	
	ТЧ = Вопрос.ВариантыОтветов;
	
	Нов = ТЧ.Добавить();
	Нов.ВариантОтвета = "Новый Клиент";
	
	Нов = ТЧ.Добавить();
	Нов.ВариантОтвета = "Клиент по адресу";
	
	Нов = ТЧ.Добавить();
	Нов.ВариантОтвета = "Точка не существует";
	Нов.ЗакончитьАнкетирование = Истина;
	
	Вопрос.Записать();
	
	
	
	Вопрос = Справочники.ВопросыАнкетДляТП.СоздатьЭлемент();
	Вопрос.Наименование = "Сотрудничество";
	Вопрос.ТипВопроса = Перечисления.ТипыВопросовАнкетДляТП.ВыборЗначенияИзСписка;
	Вопрос.Владелец = Шаблон.Ссылка;
	
	ТЧ = Вопрос.ВариантыОтветов;
	
	Нов = ТЧ.Добавить();
	Нов.ВариантОтвета = "Хочет";
	
	Нов = ТЧ.Добавить();
	Нов.ВариантОтвета = "Нехочет";
	Нов.ЗакончитьАнкетирование = Истина;
	
	Вопрос.Записать();
	
	
	Вопрос2 = Справочники.ВопросыАнкетДляТП.СоздатьЭлемент();
	Вопрос2.Наименование = "Телефон";
	Вопрос2.ТипВопроса = Перечисления.ТипыВопросовАнкетДляТП.ВводЗначения;
	Вопрос2.Владелец = Шаблон.Ссылка;
	Вопрос2.Родитель = Вопрос.Ссылка;
	Вопрос2.ОтветРодителя = "Хочет";
	
	Вопрос2.Записать();
	
	Вопрос2 = Справочники.ВопросыАнкетДляТП.СоздатьЭлемент();
	Вопрос2.Наименование = "Причина отказа";
	Вопрос2.ТипВопроса = Перечисления.ТипыВопросовАнкетДляТП.ВводЗначения;
	Вопрос2.Владелец = Шаблон.Ссылка;
	Вопрос2.Родитель = Вопрос.Ссылка;
	Вопрос2.ОтветРодителя = "Нехочет";
	
	Вопрос2.Записать();
	
КонецПроцедуры
